package ru.oop;
/**
 * @author Alexander Kaleganov
 * попробую разобраться с ООП
 * теорию захвотил ещё из базового синтаксиса где сказано было почитать шилтда
 * там вообщем в ооп есть три принципа:
 * 1инкапсуляция
 * 2наследование
 * 3полиморфизм
 * 1 - инкапсуляция это такая штука, которая помогает взаимодействовать коду
 * и данным и защищает их от неправомерного изменения
 * можно сказать что класс инкапсулирует какие -то своства объекту
 * 2 наследование это значит что оин клас может унаследовать от материнского класса все его поля и методы
 * за исключением конструкторов
 * а полиморфизм - опрееление не помню но по сути это когда  один метод а действия разные
 * к примеру мы взяли метод обозвали его и метод получает инты
 * и тутже рядом создаём ещё один метод с таким же именем и он получает стринг и в зависимости от того какие
 * данные получает метод тот и будет использоваться
 * 2
 */