package ru.oop.Tracker;
/*
здесь у нас будет программа трекер
мы будем создавать заявки добавлять и редактировать, В данном проекте будет разбираться тема инкапсуляция,
по сути инкапсуляция обеспечивает взаимодействие кода и данных и защищыет данные от неправомерного изменения,
исходя из определения попробуем сделать класс Item с модификатором доступа private и в пакет запихаем класс Tracker
с модификатором доступа default т.е. , всё что происходит в классе  Itemsникто не должен видеть кроме классаа Tracker
 */